cask_args appdir: '/Applications'

tap "homebrew/bundle"


# system 
brew 'vim' 
brew 'git'
brew "git-lfs"
brew 'wget'
brew 'curl'
brew 'make'
brew 'cmake'
brew 'gnupg'
brew 'bash'
brew 'coreutils'
brew 'findutils'
brew 'openssh'
brew 'grep'


# cli
brew 'zoxide'
brew 'gh'
brew 'jq'
brew 'bash'
brew 'tree'
brew 'tmux'
brew 'zsh'
brew 'zplug'
brew 'the_silver_searcher'
brew 'ripgrep'
brew 'perl'
brew 'universal-ctags'
brew 'peco'
brew 'bat'
brew 'fd'
brew 'fzf'
brew 'direnv'
brew 'knqyf263/pet/pet'
brew 'forgit'
brew 'eza'
brew 'trash-cli'
brew 'pandoc'
brew 'grc'
brew 'lesspipe'
brew 'lsd'


# development
brew 'mise'
brew 'gradle'
brew 'mvn'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'python@3.11'
brew 'diff-so-fancy'
brew 'git-delta'
brew 'kubectl'
brew 'kubectx'
brew 'k9s'
brew 'johanhaleby/kubetail/kubetail'
brew 'helm'
brew 'mysql'
brew 'pkg-config'
brew 'git-absorb'


# app
cask "1password"
cask "1password-cli"
cask "alfred"


# cask
cask 'hammerspoon'
cask 'slack'
cask 'visual-studio-code'
cask 'intellij-idea'
cask 'datagrip'
cask 'webstorm'
cask 'pycharm'
cask 'font-droid-sans-mono-for-powerline'

cask 'alt-tab'
cask 'monitorcontrol'
cask 'numi'

# cask 'nikitabobko/tap/aerospace'
# cask 'jordanbaird-ice'
# cask 'obsidian'
